//void main()
//{
//   int a = 6, c;
//   int b;
//
//   // Ошабка с использованием 
//   // неинициализированной переменной. 
//   b = 2;
//
//   // Ошибка с повторным объявлением.
//   //int b;
//
//   // Проверка: польский стек.
//   //int a = 1, b = 2, c = 3, d = 4;
//   //int p = a + b * c - d * (a + b);
//
//   /*
//   * Проверка распознавания и 
//   * токенизации операторов и 
//   * выражений if - else
//   */
//
//   int p, d = 3;
//   if (a < b)
//   {
//      c = b - a;
//      if (a == 1)
//      {
//         c = a + b;
//      }
//   }
//   else
//   {
//      if (a == 1)
//      {
//         c = a - b;
//      }
//
//      p = a + b * c - d * (a + b);
//   }
//}
//
//// Пример стека 
//// a 6 = b 2 = a b < m0 UPL c b a - = a 1 == m1 UPL
//// c a b + = m1: m2 BP m0: a 1 == m3 UPL c a b - = m3: a 5 = m2:
















// Тут sum должен стать 180
void main()
{
   int a = 10;
   int b = 5;
   int p = 9, d = 2;
   int sum;

   if (a != b) // Правда
   {
      sum = a - b;
      if (a == 5) // Ложь
      {
         sum = b;
      }
      else
      {
         // sum = 180
         sum = p * d * (b + sum);
      }
   }
   else
   {
      // sum = 15
      sum = d * (a + b) - (a + b);
   }
}
